## Primero, importamos los módulos y el archivo csv sobre el que vamos a trabajar

In [1]:
import pandas as pd
import numpy as np
import re

In [2]:
df = pd.read_csv('input/attacks.csv', encoding='latin')

In [3]:
df

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2018.06.25,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,...,White shark,"R. Collier, GSAF",2018.06.25-Wolfe.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.25,2018.06.25,6303.0,NaN,NaN
1,2018.06.18,18-Jun-2018,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,Adyson McNeely,F,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.18-McNeely.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.18,2018.06.18,6302.0,NaN,NaN
2,2018.06.09,09-Jun-2018,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,John Denges,M,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.09-Denges.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.09,2018.06.09,6301.0,NaN,NaN
3,2018.06.08,08-Jun-2018,2018.0,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,Surfing,male,M,...,2 m shark,"B. Myatt, GSAF",2018.06.08-Arrawarra.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.08,2018.06.08,6300.0,NaN,NaN
4,2018.06.04,04-Jun-2018,2018.0,Provoked,MEXICO,Colima,La Ticla,Free diving,Gustavo Ramos,M,...,"Tiger shark, 3m",A .Kipper,2018.06.04-Ramos.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.04,2018.06.04,6299.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25718,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25719,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25720,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25721,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25722,xx,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# Vamos a analizar las columnas y nos quedamos con las que vamos a trabajar para nuestra hipótesis

In [4]:
df.columns

Index(['Case Number', 'Date', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex ', 'Age', 'Injury', 'Fatal (Y/N)', 'Time',
       'Species ', 'Investigator or Source', 'pdf', 'href formula', 'href',
       'Case Number.1', 'Case Number.2', 'original order', 'Unnamed: 22',
       'Unnamed: 23'],
      dtype='object')

In [5]:
dfin=df[["Year", "Country", "Activity", "Type", "Fatal (Y/N)",]]
dfin

         Year    Country     Activity        Type Fatal (Y/N)
0      2018.0        USA     Paddling     Boating           N
1      2018.0        USA     Standing  Unprovoked           N
2      2018.0        USA      Surfing     Invalid           N
3      2018.0  AUSTRALIA      Surfing  Unprovoked           N
4      2018.0     MEXICO  Free diving    Provoked           N
...       ...        ...          ...         ...         ...
25718     NaN        NaN          NaN         NaN         NaN
25719     NaN        NaN          NaN         NaN         NaN
25720     NaN        NaN          NaN         NaN         NaN
25721     NaN        NaN          NaN         NaN         NaN
25722     NaN        NaN          NaN         NaN         NaN

[25723 rows x 5 columns]

# Limpiamos las filas donde todas las columnas están con NaN

In [6]:
dfin.isnull().sum().sort_values(ascending=False).head(20)

Activity       19965
Fatal (Y/N)    19960
Country        19471
Type           19425
Year           19423
dtype: int64

In [7]:
dfin=dfin.dropna(axis=0, how='all')

In [8]:
dfin.isnull().sum().sort_values(ascending=False).head(20)

Activity       544
Fatal (Y/N)    539
Country         50
Type             4
Year             2
dtype: int64

In [9]:
dfin["Year"].value_counts().sort_values('index', ascending=True).head(5)

1786.0    1
1554.0    1
1771.0    1
1721.0    1
1742.0    1
Name: Year, dtype: int64

In [10]:
dfin['Year'] = dfin['Year'].fillna(0)

/home/jorge/.local/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [11]:
dfin.isnull().sum().sort_values(ascending=False).head(20)

Activity       544
Fatal (Y/N)    539
Country         50
Type             4
Year             0
dtype: int64

In [12]:
dfin.Year = dfin.Year.astype(int)

/home/jorge/.local/lib/python3.6/site-packages/pandas/core/generic.py:5303: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [13]:
dfin["Year"].value_counts()

2015    143
2017    136
2016    130
2011    128
0       127
       ...
1742      1
1738      1
1638      1
5         1
1543      1
Name: Year, Length: 249, dtype: int64

In [14]:
dfin["Fatal (Y/N)"].value_counts()

N          4293
Y          1388
UNKNOWN      71
 N            7
y             1
M             1
2017          1
N             1
Name: Fatal (Y/N), dtype: int64

In [15]:
dfin['Fatal (Y/N)'] = dfin['Fatal (Y/N)'].fillna("UNKNOWN")

/home/jorge/.local/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [16]:
def fatal(x):
    if x in ["Y", "y"]:
        return "Yes"
    elif x in ["N"," N"]:
        return "No"    
    return "Unknown"


dfin["Fatal (Y/N)"] = dfin["Fatal (Y/N)"].apply(fatal)

/home/jorge/.local/lib/python3.6/site-packages/ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if __name__ == '__main__':

In [17]:
def year(x):
    if x >= 1930 and x <=1939:
        return "1930's"
    if x >= 1940 and x <=1949:
        return "1940's"
    if x >= 1950 and x <=1959:
        return "1950's"
    if x >= 1960 and x <=1969:
        return "1960's"
    if x >= 1970 and x <=1979:
        return "1970's"
    if x >= 1980 and x <=1989:
        return "1980's"
    if x >= 1990 and x <=1999:
        return "1990's"
    if x >= 2000 and x <=2010:
        return "2000's"
    if x >= 2010:
        return "2010's"
    return "Before 1930"

dfin["Year"]= dfin["Year"].apply(year)

/home/jorge/.local/lib/python3.6/site-packages/ipykernel_launcher.py:22: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [18]:
dfin["Year"].value_counts()

Before 1930    1248
2000's         1122
2010's          956
1960's          618
1990's          569
1950's          464
1980's          434
1970's          334
1940's          283
1930's          274
Name: Year, dtype: int64

In [19]:
dfin["Country"].value_counts()

USA                     2229
AUSTRALIA               1338
SOUTH AFRICA             579
PAPUA NEW GUINEA         134
NEW ZEALAND              128
                        ...
BRITISH NEW GUINEA         1
NETHERLANDS ANTILLES       1
MALDIVE ISLANDS            1
ARGENTINA                  1
MAYOTTE                    1
Name: Country, Length: 212, dtype: int64

In [20]:
dfin["Fatal (Y/N)"].value_counts()

No         4300
Yes        1389
Unknown     613
Name: Fatal (Y/N), dtype: int64

In [21]:
dfin.head()

     Year    Country     Activity        Type Fatal (Y/N)
0  2010's        USA     Paddling     Boating          No
1  2010's        USA     Standing  Unprovoked          No
2  2010's        USA      Surfing     Invalid          No
3  2010's  AUSTRALIA      Surfing  Unprovoked          No
4  2010's     MEXICO  Free diving    Provoked          No

In [22]:

new2 = dfin.groupby(["Year", "Fatal (Y/N)"]).agg({"Fatal (Y/N)":"count"})

new2.head()

                    Fatal (Y/N)
Year   Fatal (Y/N)
1930's No                   163
       Unknown               27
       Yes                   84
1940's No                   158
       Unknown               22

In [23]:
groupped_data = dfin.groupby(["Year", "Fatal (Y/N)"]).agg({"Fatal (Y/N)":"count"})
groupped_data["%"] = groupped_data.apply(lambda x:  100*x / x.sum())


groupped_data["%"] = groupped_data.groupby(level=0).apply(
     lambda x:  100*x / x.sum()
)
groupped_data.head(10)

                    Fatal (Y/N)          %
Year   Fatal (Y/N)
1930's No                   163  59.489051
       Unknown               27   9.854015
       Yes                   84  30.656934
1940's No                   158  55.830389
       Unknown               22   7.773852
       Yes                  103  36.395760
1950's No                   286  61.637931
       Unknown               42   9.051724
       Yes                  136  29.310345
1960's No                   422  68.284790

In [24]:
dfin.head()

     Year    Country     Activity        Type Fatal (Y/N)
0  2010's        USA     Paddling     Boating          No
1  2010's        USA     Standing  Unprovoked          No
2  2010's        USA      Surfing     Invalid          No
3  2010's  AUSTRALIA      Surfing  Unprovoked          No
4  2010's     MEXICO  Free diving    Provoked          No

In [25]:
indexNames = dfin[(dfin['Country'] != "USA") & (dfin['Country'] != "AUSTRALIA")].index
dfin.drop(indexNames , inplace=True)

/home/jorge/.local/lib/python3.6/site-packages/pandas/core/frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [26]:
new2 = dfin.groupby(["Country", "Fatal (Y/N)"]).agg({"Fatal (Y/N)":"count"})
new2["%"] = new2.apply(lambda x:  100*x / x.sum())


new2["%"] = new2.groupby(level=0).apply(
     lambda x:  100*x / x.sum()
)
new2.head(20)

                       Fatal (Y/N)          %
Country   Fatal (Y/N)
AUSTRALIA No                   920  68.759342
          Unknown              135  10.089686
          Yes                  283  21.150972
USA       No                  1837  82.413638
          Unknown              206   9.241812
          Yes                  186   8.344549

In [27]:
aus_data= dfin[dfin["Country"] == "AUSTRALIA"].groupby(["Year", "Fatal (Y/N)"]).agg({"Fatal (Y/N)":"count"})
aus_data["%"] = aus_data.apply(lambda x:  100*x / x.sum())


aus_data["%"] = aus_data.groupby(level=0).apply(
     lambda x:  100*x / x.sum()
)

In [28]:
usa_data= dfin[dfin["Country"] == "USA"].groupby(["Year", "Fatal (Y/N)"]).agg({"Fatal (Y/N)":"count"})
usa_data["%"] = usa_data.apply(lambda x:  100*x / x.sum())


usa_data["%"] = usa_data.groupby(level=0).apply(
     lambda x:  100*x / x.sum()
)

In [29]:
total_data= dfin[dfin["Fatal (Y/N)"] == "Yes"].groupby(["Year", "Country"]).agg({"Fatal (Y/N)":"count"})
total_data["%"] = total_data.apply(lambda x:  100*x / x.sum())
total_data["%"] = total_data.groupby(level=0).apply(
     lambda x:  100*x / x.sum()
)

In [30]:
total_data.head()

                  Fatal (Y/N)          %
Year   Country
1930's AUSTRALIA           35  81.395349
       USA                  8  18.604651
1940's AUSTRALIA           19  73.076923
       USA                  7  26.923077
1950's AUSTRALIA           16  47.058824

In [31]:
dfin2=df.copy()

In [32]:
dfin2.Country.value_counts()

USA                       2229
AUSTRALIA                 1338
SOUTH AFRICA               579
PAPUA NEW GUINEA           134
NEW ZEALAND                128
                          ...
GHANA                        1
MALDIVES                     1
GUATEMALA                    1
BRITISH VIRGIN ISLANDS       1
GRAND CAYMAN                 1
Name: Country, Length: 212, dtype: int64

In [33]:
dfin2.Country.value_counts()

USA                       2229
AUSTRALIA                 1338
SOUTH AFRICA               579
PAPUA NEW GUINEA           134
NEW ZEALAND                128
                          ...
GHANA                        1
MALDIVES                     1
GUATEMALA                    1
BRITISH VIRGIN ISLANDS       1
GRAND CAYMAN                 1
Name: Country, Length: 212, dtype: int64

In [34]:
dfin2=dfin2[["Year", "Country", "Activity", "Type", "Fatal (Y/N)",]]

In [35]:
dfin2.Country.value_counts()

USA                       2229
AUSTRALIA                 1338
SOUTH AFRICA               579
PAPUA NEW GUINEA           134
NEW ZEALAND                128
                          ...
GHANA                        1
MALDIVES                     1
GUATEMALA                    1
BRITISH VIRGIN ISLANDS       1
GRAND CAYMAN                 1
Name: Country, Length: 212, dtype: int64

In [36]:
dfin2.isnull().sum().sort_values(ascending=False).head(20)

Activity       19965
Fatal (Y/N)    19960
Country        19471
Type           19425
Year           19423
dtype: int64

In [37]:
dfin2.Country.value_counts()

USA                       2229
AUSTRALIA                 1338
SOUTH AFRICA               579
PAPUA NEW GUINEA           134
NEW ZEALAND                128
                          ...
GHANA                        1
MALDIVES                     1
GUATEMALA                    1
BRITISH VIRGIN ISLANDS       1
GRAND CAYMAN                 1
Name: Country, Length: 212, dtype: int64

In [38]:
dfin2=dfin2.dropna(axis=0, how='all')

In [39]:
dfin2.Country.value_counts()

USA                     2229
AUSTRALIA               1338
SOUTH AFRICA             579
PAPUA NEW GUINEA         134
NEW ZEALAND              128
                        ...
BRITISH NEW GUINEA         1
NETHERLANDS ANTILLES       1
MALDIVE ISLANDS            1
ARGENTINA                  1
MAYOTTE                    1
Name: Country, Length: 212, dtype: int64

In [40]:
dfin2.isnull().sum().sort_values(ascending=False).head(20)

Activity       544
Fatal (Y/N)    539
Country         50
Type             4
Year             2
dtype: int64

In [41]:
dfin2.Country.value_counts()

USA                     2229
AUSTRALIA               1338
SOUTH AFRICA             579
PAPUA NEW GUINEA         134
NEW ZEALAND              128
                        ...
BRITISH NEW GUINEA         1
NETHERLANDS ANTILLES       1
MALDIVE ISLANDS            1
ARGENTINA                  1
MAYOTTE                    1
Name: Country, Length: 212, dtype: int64

In [42]:
dfin2["Year"].value_counts().sort_values('index', ascending=True).head(5)

1786.0    1
1554.0    1
1771.0    1
1721.0    1
1742.0    1
Name: Year, dtype: int64

In [43]:
dfin2.Country.value_counts()

USA                     2229
AUSTRALIA               1338
SOUTH AFRICA             579
PAPUA NEW GUINEA         134
NEW ZEALAND              128
                        ...
BRITISH NEW GUINEA         1
NETHERLANDS ANTILLES       1
MALDIVE ISLANDS            1
ARGENTINA                  1
MAYOTTE                    1
Name: Country, Length: 212, dtype: int64

In [44]:
dfin2['Year'] = dfin2['Year'].fillna(0)

In [45]:
dfin2.Country.value_counts()

USA                     2229
AUSTRALIA               1338
SOUTH AFRICA             579
PAPUA NEW GUINEA         134
NEW ZEALAND              128
                        ...
BRITISH NEW GUINEA         1
NETHERLANDS ANTILLES       1
MALDIVE ISLANDS            1
ARGENTINA                  1
MAYOTTE                    1
Name: Country, Length: 212, dtype: int64

In [46]:
dfin2.isnull().sum().sort_values(ascending=False).head(20)

Activity       544
Fatal (Y/N)    539
Country         50
Type             4
Year             0
dtype: int64

In [47]:
dfin2.Country.value_counts()

USA                     2229
AUSTRALIA               1338
SOUTH AFRICA             579
PAPUA NEW GUINEA         134
NEW ZEALAND              128
                        ...
BRITISH NEW GUINEA         1
NETHERLANDS ANTILLES       1
MALDIVE ISLANDS            1
ARGENTINA                  1
MAYOTTE                    1
Name: Country, Length: 212, dtype: int64

In [48]:
dfin2.Year = dfin2.Year.astype(int)

In [49]:
dfin2.Country.value_counts()

USA                     2229
AUSTRALIA               1338
SOUTH AFRICA             579
PAPUA NEW GUINEA         134
NEW ZEALAND              128
                        ...
BRITISH NEW GUINEA         1
NETHERLANDS ANTILLES       1
MALDIVE ISLANDS            1
ARGENTINA                  1
MAYOTTE                    1
Name: Country, Length: 212, dtype: int64

In [50]:
dfin2["Year"].value_counts()

2015    143
2017    136
2016    130
2011    128
0       127
       ...
1742      1
1738      1
1638      1
5         1
1543      1
Name: Year, Length: 249, dtype: int64

In [51]:
dfin2.Country.value_counts()

USA                     2229
AUSTRALIA               1338
SOUTH AFRICA             579
PAPUA NEW GUINEA         134
NEW ZEALAND              128
                        ...
BRITISH NEW GUINEA         1
NETHERLANDS ANTILLES       1
MALDIVE ISLANDS            1
ARGENTINA                  1
MAYOTTE                    1
Name: Country, Length: 212, dtype: int64

In [52]:
dfin2['Fatal (Y/N)'] = dfin2['Fatal (Y/N)'].fillna("UNKNOWN")

In [53]:
dfin2.Country.value_counts()

USA                     2229
AUSTRALIA               1338
SOUTH AFRICA             579
PAPUA NEW GUINEA         134
NEW ZEALAND              128
                        ...
BRITISH NEW GUINEA         1
NETHERLANDS ANTILLES       1
MALDIVE ISLANDS            1
ARGENTINA                  1
MAYOTTE                    1
Name: Country, Length: 212, dtype: int64

In [54]:
dfin2["Fatal (Y/N)"] = dfin2["Fatal (Y/N)"].apply(fatal)

In [55]:
dfin2.Country.value_counts()

USA                     2229
AUSTRALIA               1338
SOUTH AFRICA             579
PAPUA NEW GUINEA         134
NEW ZEALAND              128
                        ...
BRITISH NEW GUINEA         1
NETHERLANDS ANTILLES       1
MALDIVE ISLANDS            1
ARGENTINA                  1
MAYOTTE                    1
Name: Country, Length: 212, dtype: int64

In [56]:
def year2(x):
    if x >= 1960 and x <=1975:
        return "Before movie"
    if x >= 1976 and x <=1990:
        return "After movie"

    return "Rest"

dfin2["Year"]= dfin2["Year"].apply(year2)

In [57]:
dfin2.Country.value_counts()

USA                     2229
AUSTRALIA               1338
SOUTH AFRICA             579
PAPUA NEW GUINEA         134
NEW ZEALAND              128
                        ...
BRITISH NEW GUINEA         1
NETHERLANDS ANTILLES       1
MALDIVE ISLANDS            1
ARGENTINA                  1
MAYOTTE                    1
Name: Country, Length: 212, dtype: int64

In [58]:
indexNames = dfin2[(dfin2['Year'] != "Before movie") & (dfin2['Year'] != "After movie")].index
dfin2.drop(indexNames , inplace=True)

In [59]:
dfin2.Country.value_counts()

USA                       484
AUSTRALIA                 248
SOUTH AFRICA              243
PAPUA NEW GUINEA           49
NEW ZEALAND                27
                         ...
MADAGASCAR                  1
UNITED KINGDOM              1
RED SEA                     1
BRITISH ISLES               1
RED SEA / INDIAN OCEAN      1
Name: Country, Length: 88, dtype: int64

In [60]:
groupped_data2 = dfin2.groupby(["Year", "Fatal (Y/N)"]).agg({"Fatal (Y/N)":"count"})
groupped_data2["%"] = groupped_data2.apply(lambda x:  100*x / x.sum())


groupped_data2["%"] = groupped_data2.groupby(level=0).apply(
     lambda x:  100*x / x.sum()
)
groupped_data2.sort_values("Year", ascending=False)

                          Fatal (Y/N)          %
Year         Fatal (Y/N)
Before movie No                   581  69.414576
             Unknown               96  11.469534
             Yes                  160  19.115890
After movie  No                   442  75.298126
             Unknown               71  12.095400
             Yes                   74  12.606474

In [61]:
dfin2.Country.value_counts()

USA                       484
AUSTRALIA                 248
SOUTH AFRICA              243
PAPUA NEW GUINEA           49
NEW ZEALAND                27
                         ...
MADAGASCAR                  1
UNITED KINGDOM              1
RED SEA                     1
BRITISH ISLES               1
RED SEA / INDIAN OCEAN      1
Name: Country, Length: 88, dtype: int64

In [62]:
dfin3 = dfin2.copy()

In [63]:
dfin3 = dfin3[dfin3["Country"] == "USA"]

In [68]:
groupped_data3 = dfin3.groupby(["Year", "Fatal (Y/N)"]).agg({"Fatal (Y/N)":"count"})
groupped_data3["%"] = groupped_data3.apply(lambda x:  100*x / x.sum())


groupped_data3["%"] = groupped_data3.groupby(level=0).apply(
     lambda x:  100*x / x.sum()
)
groupped_data3.sort_values("Year", ascending=False)

                          Fatal (Y/N)          %
Year         Fatal (Y/N)
Before movie No                   163  75.115207
             Unknown               40  18.433180
             Yes                   14   6.451613
After movie  No                   223  83.520599
             Unknown               26   9.737828
             Yes                   18   6.741573